-- ~/.config/nvim/lua/plugins/snacks.lua
return {
  {
    "folke/snacks.nvim",
    lazy = false,
    priority = 1000,
    opts = {
      picker = {
        hidden = true,
        ignored = true,
        sources = {
          explorer = {
            include = { ".gitignore" },
          },
        },
      },
      dashboard = {
        enabled = true,
        preset = {
          name = "default",
          header = table.concat({
            "██╗██████╗ ██╗    ██╗██╗███╗   ██╗    ██████╗ ███████╗██╗  ██╗",
            "██║██╔══██╗██║    ██║██║████╗  ██║    ██╔══██╗██╔════╝╚██╗██╔╝",
            "██║██████╔╝██║ █╗ ██║██║██╔██╗ ██║    ██████╔╝█████╗   ╚███╔╝ ",
            "██║██╔══██╗██║███╗██║██║██║╚██╗██║    ██╔══██╗██╔══╝   ██╔██╗ ",
            "██║██║  ██║╚███╔███╔╝██║██║ ╚████║    ██║  ██║███████╗██╔╝ ██╗",
            "╚═╝╚═╝  ╚═╝ ╚══╝╚══╝ ╚═╝╚═╝  ╚═══╝    ╚═╝  ╚═╝╚══════╝╚═╝  ╚═╝",
            "",
            "      Welcome back, Good luck for zero bugs ! 🚀",
          }, "\n"),
        },
      },
    },
    keys = {
      { "<leader>gg", function() Snacks.lazygit() end, desc = "Lazygit" },
    },
  },
}
